Repository: xeno-by/elf4b
Catalog: Tiller/Esath.Pie/ElfEditor.*.resx
Languages: ru_ru

# _lineOfCodeLabel.Text
source: Line of code:
ru_ru: Строка сценария:

# _addButton.Text
source: Add
ru_ru: Создать

# _deleteButton.Text
source: Delete
ru_ru: Удалить

# _moveUpButton.Text
source: Move up
ru_ru: Переместить вверх

# _moveDownButton.Text
source: Move down
ru_ru: Переместить вниз

# _noParamsLabel.Text
source: This function has no parameters.
ru_ru: У этой функции нет параметров

# label1.Text
source: (!) The value entered doesn't correspond to selected data type
ru_ru: (!) Набранное значение не соответствует выбранному типу

# richTextBox1.Text
source: Nothing is selected. This panel is designed for editing sub-expressions that are parts of the lines of code displayed above. To start editing, double-click the line of code or its accompanying label. If there are no lines of code shown, use the "Add" button to create one.
ru_ru: Редактируемая формула не выбрана. Эта панель предназначена для редактирования формул и их фрагментов, относящихся к строкам сценария, отображенным сверху. Чтобы начать редактирование строки, два раза щелкните по соответствующему полю ввода. Если редактируемый сценарий пока что не содержит строк, нажмите "Создать", чтобы их добавить.

# toolStripLabel1.Text
source: Expression type:
ru_ru: Тип выражения:

# _constButton.Text
source: Const
ru_ru: Значение

# _varButton.Text
source: Var
ru_ru: Ссылка

# _fxButton.Text
source: Fx
ru_ru: Функция

# _nodeButton.Text
source: Node
ru_ru: Узел

# _ctypeLabel.Text
source: Type:
ru_ru: Тип значения:

# _fxTypeLabel.Text
source: Function:
ru_ru: Функция:

# _argcLabel.Text
source: args
ru_ru: параметров

# _upOneLevelButton.Text
source: Up one level
ru_ru: На уровень выше

# _wrapInFxButton.Text
source: Wrap in fx
ru_ru: Обернуть

# _extractFromFxButton.Text
source: Extract from fx
ru_ru: Извлечь

# _nowEditingLabel.Text
source: Now editing:
ru_ru: Редактируемая формула:
